pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
/**
 * @file ui_task.cpp
 * @brief UI Task Implementation for MIPI DSI Display with LVGL
 *
 * This implementation provides full LVGL integration with MIPI DSI display
 * using the Waveshare 5-DSI-TOUCH-A display and HX8394 driver.
 */

#include "ui_task.h"

#include <stdlib.h>

#include "comm/statistics.h"
#include "config/hardware_config.h"
#include "config/pin_config.h"
#include "esp_check.h"
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/event_groups.h"
#include "freertos/portable.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "inter_mcu.h"
#include "links/esp_spi_link.h"
#include "pcnt_task.h"
#include "ui/ui_api.h"
#include "ui/ui_busy_overlay.h"
#include "ui/ui_sample_browser.h"
#include "ui/ui_screenshot.h"

// LVGL includes
#include "esp_heap_caps.h"
#include "esp_lvgl_port.h"
#include "esp_timer.h"
#include "lvgl.h"
#include "ui/display_manager.h"
#include "ui/input_dispatcher.h"
#include "ui/ui_demo.h"
#include "ui/ui_navigation_integration.h"

// LVGL port lock macros for thread safety
#define LV_LOCK() lvgl_port_lock(portMAX_DELAY)
#define LV_UNLOCK() lvgl_port_unlock()

// Include BSP header for display functions
#include "bsp/esp32_p4_nano.h"
#include "ui/tca8418_keypad.h"

static const char *TAG = "UI_TASK";

// Peak hold tracking timeout
static const uint32_t PEAK_HOLD_TIMEOUT_MS = 500;  // Configurable peak hold duration

// Adaptive refresh rate control constants
static const uint32_t MIN_REFRESH_INTERVAL_MS = 16;   // 60 FPS maximum
static const uint32_t MAX_REFRESH_INTERVAL_MS = 100;  // 10 FPS minimum

// Global UITask instance (singleton pattern)
static UITask *g_ui_task_instance = nullptr;

// UITask class implementation
UITask::UITask(WaveX::Comm::ICommInterface &comm_interface) : m_comm_interface(comm_interface) {
    // Initialize the UI context with injected dependencies
    m_context.comm_interface = &m_comm_interface;

    // Register comm interface with UI system for page creation
    wavex_ui::ui_set_comm_interface(&m_comm_interface);

    ESP_LOGI(TAG, "UITask created with injected CommInterface");
}

esp_err_t UITask::init() {
    ESP_LOGI(TAG, "Initializing UITask");

    // Initialize LVGL display
    ESP_LOGI(TAG, "Initializing LVGL display...");
    esp_err_t lvgl_ret = wavex_ui::DisplayManager::instance().init();
    if (lvgl_ret != ESP_OK) {
        ESP_LOGE(TAG, "Failed to initialize LVGL display: %s", esp_err_to_name(lvgl_ret));
        return lvgl_ret;
    }

    ESP_LOGI(TAG, "LVGL display initialized successfully");

    // Log memory status
    ESP_LOGI(TAG, "Memory after display init:");
    ESP_LOGI(TAG, "  Free heap: %zu bytes", esp_get_free_heap_size());

    return ESP_OK;
}

esp_err_t UITask::start() {
    ESP_LOGI(TAG, "Starting UITask");

    // Register meter data callback for real-time audio meter updates
    m_context.comm_interface->setMeterListener(meterDataCallback, &m_context);
    ESP_LOGI(TAG, "Meter data callback registered via interface");

    // Test meter callback with dummy stereo data to verify it's working
    ESP_LOGI(TAG, "Testing meter callback with dummy stereo data...");
    meterDataCallback(0.5f, 0.4f, 0.8f, 0.7f, &m_context);  // Test with 50%/40% RMS, 80%/70% peak

    // Start TCA8418 keypad on BSP I2C; INT on GPIO31 per pin_config
    {
        const int tca_int_gpio = WAVEX_ESP_BTN_INT;  // GPIO31
        const uint8_t tca_addr = 0x34;
        esp_err_t kret = wavex_ui::tca8418_keypad_start(tca_int_gpio, tca_addr);
        if (kret != ESP_OK) {
            ESP_LOGE(TAG, "Failed to start TCA8418 keypad: %s", esp_err_to_name(kret));
        } else {
            ESP_LOGI(
                TAG, "TCA8418 keypad started (INT GPIO=%d, addr=0x%02X)", tca_int_gpio, tca_addr);
        }
    }

    // Initialize navigation system
    wavex_ui::initNavigationSystem();

    // Set navigation context as active input handler
    wavex_ui::InputDispatcher::instance().setActiveContext(wavex_ui::createNavigationContext());

    // Create and start meter update timer
    const esp_timer_create_args_t meter_timer_args = {.callback = &meterUpdateCallback,
                                                      .arg = &m_context,
                                                      .dispatch_method = ESP_TIMER_TASK,
                                                      .name = "meter_timer",
                                                      .skip_unhandled_events = false};
    esp_err_t timer_ret = esp_timer_create(&meter_timer_args, &m_context.meter_timer_handle);
    if (timer_ret == ESP_OK) {
        esp_timer_start_periodic(m_context.meter_timer_handle, 33000); // 33ms in microseconds (30 FPS)
        ESP_LOGI(TAG, "Meter timer started (33ms real-time updates - 30 FPS)");
    } else {
        ESP_LOGE(TAG, "Failed to create meter timer: %s", esp_err_to_name(timer_ret));
        return timer_ret;
    }

    // Create UI task
    BaseType_t task_ret =
        xTaskCreatePinnedToCore(uiTaskFunction,
                                "ui_task",
                                16384,  // Increased stack size for LVGL and diagnostics
                                this,   // Pass this instance as parameter
                                2,      // Priority
                                &m_context.ui_task_handle,
                                1  // Run on Core 1
        );

    if (task_ret != pdPASS) {
        ESP_LOGE(TAG, "Failed to create UI task");
        return ESP_FAIL;
    }

    // Set global instance
    g_ui_task_instance = this;

    ESP_LOGI(TAG, "UITask started successfully");
    return ESP_OK;
}

esp_err_t UITask::stop() {
    ESP_LOGI(TAG, "Stopping UITask");

    if (m_context.ui_task_handle != NULL) {
        vTaskDelete(m_context.ui_task_handle);
        m_context.ui_task_handle = NULL;
    }

    // Stop and delete the meter timer
    if (m_context.meter_timer_handle) {
        esp_timer_stop(m_context.meter_timer_handle);
        esp_timer_delete(m_context.meter_timer_handle);
        m_context.meter_timer_handle = NULL;
    }

    // Delete LVGL timer
    if (m_context.meter_lvgl_timer) {
        lv_timer_delete(m_context.meter_lvgl_timer);
        m_context.meter_lvgl_timer = NULL;
    }

    // Let display manager clean up LVGL and touch resources
    wavex_ui::DisplayManager::instance().deinit();

    ESP_LOGI(TAG, "UITask stopped");
    return ESP_OK;
}

