pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
void UITask::markContentChanged() {
    m_context.content_changed = true;
}

esp_err_t UITask::getPanelHandle(esp_lcd_panel_handle_t *panel_handle) {
    return wavex_ui::DisplayManager::instance().panelHandle(panel_handle);
}

// Static callback functions (need to access UITask instance)
void UITask::meterUpdateCallback(void *arg) {
    UiContext *ctx = (UiContext *)arg;
    if (!ctx)
        return;

    uint32_t current_time_ms = (uint32_t)(esp_timer_get_time() / 1000);
    bool should_reset_meters = false;

    // Check if we have valid callback data and if it's recent (within 500ms)
    if (ctx->meter_callback_data_valid) {
        uint32_t time_since_callback = current_time_ms - ctx->last_callback_time_ms;
        if (time_since_callback > 500) {
            // Callback data is stale, reset meters
            should_reset_meters = true;
            ctx->meter_callback_data_valid = false;
        }
    } else {
        // No callback data received yet, reset meters (normal when no audio is running)
        should_reset_meters = true;
    }

    if (should_reset_meters) {
        // Only reset if we haven't already reset recently (avoid continuous updates)
        static uint32_t last_reset_time = 0;
        uint32_t time_since_reset = current_time_ms - last_reset_time;

        if (time_since_reset > 1000) {  // Only reset once per second
            // Reset peak hold values to 0
            ctx->meter_display.peak_hold_l.peak_value = 0.0f;
            ctx->meter_display.peak_hold_l.peak_time_ms = current_time_ms;
            ctx->meter_display.peak_hold_l.is_holding = false;

            ctx->meter_display.peak_hold_r.peak_value = 0.0f;
            ctx->meter_display.peak_hold_r.peak_time_ms = current_time_ms;
            ctx->meter_display.peak_hold_r.is_holding = false;

            last_reset_time = current_time_ms;

            // Mark meter reset as pending (will be processed by main UI task)
            ctx->meter_reset_pending = true;
            if (g_ui_task_instance) {
                g_ui_task_instance->markContentChanged();
            }
        }
    } else if (ctx->meter_callback_data_valid) {
        // Normal operation - update meters with valid callback data
        // Update peak hold tracking
        updatePeakHoldL(ctx->meter_display.peak_hold_l, ctx->current_peak_left, current_time_ms);
        updatePeakHoldR(ctx->meter_display.peak_hold_r, ctx->current_peak_right, current_time_ms);

        // Store meter data for deferred update (no LVGL locks in timer callback)
        ctx->deferred_rms_left = ctx->current_rms_left;
        ctx->deferred_rms_right = ctx->current_rms_right;
        ctx->deferred_peak_left = ctx->meter_display.peak_hold_l.peak_value;
        ctx->deferred_peak_right = ctx->meter_display.peak_hold_r.peak_value;

        // Mark meter update as pending (will be processed by main UI task)
        ctx->meter_update_pending = true;
        if (g_ui_task_instance) {
            g_ui_task_instance->markContentChanged();
        }
    }
}

void UITask::lvglMeterApplyCallback(lv_timer_t *timer) {
    UiContext *ctx = (UiContext *)lv_timer_get_user_data(timer);
    if (!ctx)
        return;

    if (!ctx->meter_update_pending && !ctx->meter_reset_pending)
        return;

    // Reset handling
    if (ctx->meter_reset_pending) {
        if (ctx->meter_display.bar_l && ctx->meter_display.bar_r &&
            ctx->meter_display.peak_line_l && ctx->meter_display.peak_line_r &&
            lv_obj_is_valid(ctx->meter_display.bar_l) &&
            lv_obj_is_valid(ctx->meter_display.bar_r) &&
            lv_obj_is_valid(ctx->meter_display.peak_line_l) &&
            lv_obj_is_valid(ctx->meter_display.peak_line_r)) {
            lv_bar_set_value(ctx->meter_display.bar_l, 0, LV_ANIM_ON);
            lv_bar_set_value(ctx->meter_display.bar_r, 0, LV_ANIM_ON);
            updatePeakLinePosition(ctx->meter_display.peak_line_l, ctx->meter_display.bar_l, 0.0f);
            updatePeakLinePosition(ctx->meter_display.peak_line_r, ctx->meter_display.bar_r, 0.0f);
            if (ctx->meter_display.label_l && lv_obj_is_valid(ctx->meter_display.label_l))
                lv_label_set_text(ctx->meter_display.label_l, "L: 0.000\nPeak: 0.000");
            if (ctx->meter_display.label_r && lv_obj_is_valid(ctx->meter_display.label_r))
                lv_label_set_text(ctx->meter_display.label_r, "R: 0.000\nPeak: 0.000");
        }
        ctx->meter_reset_pending = false;
        ctx->meter_update_pending = false;
        return;
    }

    if (ctx->meter_update_pending) {
        if (ctx->meter_display.bar_l && ctx->meter_display.bar_r &&
            ctx->meter_display.peak_line_l && ctx->meter_display.peak_line_r &&
            lv_obj_is_valid(ctx->meter_display.bar_l) &&
            lv_obj_is_valid(ctx->meter_display.bar_r) &&
            lv_obj_is_valid(ctx->meter_display.peak_line_l) &&
            lv_obj_is_valid(ctx->meter_display.peak_line_r)) {
            int rms_l_value = (int)(ctx->deferred_rms_left * 100.0f);
            int rms_r_value = (int)(ctx->deferred_rms_right * 100.0f);
            if (rms_l_value > 100)
                rms_l_value = 100;
            if (rms_r_value > 100)
                rms_r_value = 100;
            lv_bar_set_value(ctx->meter_display.bar_l, rms_l_value, LV_ANIM_ON);
            lv_bar_set_value(ctx->meter_display.bar_r, rms_r_value, LV_ANIM_ON);
            updatePeakLinePosition(
                ctx->meter_display.peak_line_l, ctx->meter_display.bar_l, ctx->deferred_peak_left);
            updatePeakLinePosition(
                ctx->meter_display.peak_line_r, ctx->meter_display.bar_r, ctx->deferred_peak_right);
            if (ctx->meter_display.label_l && lv_obj_is_valid(ctx->meter_display.label_l)) {
                char label_text[32];
                snprintf(label_text,
                         sizeof(label_text),
                         "L: %.3f\nPeak: %.3f",
                         ctx->deferred_rms_left,
                         ctx->deferred_peak_left);
                lv_label_set_text(ctx->meter_display.label_l, label_text);
            }
            if (ctx->meter_display.label_r && lv_obj_is_valid(ctx->meter_display.label_r)) {
                char label_text[32];
                snprintf(label_text,
                         sizeof(label_text),
                         "R: %.3f\nPeak: %.3f",
                         ctx->deferred_rms_right,
                         ctx->deferred_peak_right);
                lv_label_set_text(ctx->meter_display.label_r, label_text);
            }
        }
        ctx->meter_update_pending = false;
    }
}

void UITask::meterDataCallback(
    float rms_left, float rms_right, float peak_left, float peak_right, void *user_data) {
    UiContext *ctx = (UiContext *)user_data;
    if (!ctx)
        return;

// Debug logging for meter data
#ifdef WAVEX_LOG_METER_DATA
    ESP_LOGI(TAG,
             "Meter data received: RMS_L=%.3f RMS_R=%.3f Peak_L=%.3f Peak_R=%.3f",
             rms_left,
             rms_right,
             peak_left,
             peak_right);
#endif

    // Store real-time stereo meter data in context
    ctx->current_rms_left = rms_left;
    ctx->current_rms_right = rms_right;
    ctx->current_peak_left = peak_left;
    ctx->current_peak_right = peak_right;

    // Mark that we have fresh callback data available
    ctx->meter_callback_data_valid = true;
    ctx->last_callback_time_ms = (uint32_t)(esp_timer_get_time() / 1000);
}

// Peak hold management
void UITask::updatePeakHoldL(PeakHoldData &peak_data,
                             float current_peak,
                             uint32_t current_time_ms) {
    if (current_peak > peak_data.peak_value) {
        // New peak detected - start holding
        peak_data.peak_value = current_peak;
        peak_data.peak_time_ms = current_time_ms;
        peak_data.is_holding = true;
    } else if (peak_data.is_holding &&
               (current_time_ms - peak_data.peak_time_ms) >= PEAK_HOLD_TIMEOUT_MS) {
        // Peak hold timeout expired - revert to current peak
        peak_data.peak_value = current_peak;
        peak_data.is_holding = false;
    }
}

void UITask::updatePeakHoldR(PeakHoldData &peak_data,
                             float current_peak,
                             uint32_t current_time_ms) {
    if (current_peak > peak_data.peak_value) {
        // New peak detected - start holding
        peak_data.peak_value = current_peak;
        peak_data.peak_time_ms = current_time_ms;
        peak_data.is_holding = true;
    } else if (peak_data.is_holding &&
               (current_time_ms - peak_data.peak_time_ms) >= PEAK_HOLD_TIMEOUT_MS) {
        // Peak hold timeout expired - revert to current peak
        peak_data.peak_value = current_peak;
        peak_data.is_holding = false;
    }
}

void UITask::updatePeakLinePosition(lv_obj_t *peak_line, lv_obj_t *meter_bar, float peak_value) {
    if (!peak_line || !meter_bar || !lv_obj_is_valid(peak_line) || !lv_obj_is_valid(meter_bar)) {
        return;
    }

