pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
    // Get meter bar dimensions (peak line is now a child of meter bar)
    lv_coord_t bar_width = lv_obj_get_width(meter_bar);
    lv_coord_t bar_height = lv_obj_get_height(meter_bar);

    // Calculate peak position (0-100% of bar width)
    int peak_percent = (int)(peak_value * 100.0f);
    if (peak_percent > 100)
        peak_percent = 100;
    if (peak_percent < 0)
        peak_percent = 0;

    // Position peak line within the meter bar (relative to bar)
    lv_coord_t peak_x = (bar_width * peak_percent) / 100;
    lv_obj_set_pos(peak_line, peak_x, 0);
    lv_obj_set_size(peak_line, 2, bar_height);  // 2px wide vertical line

    // Show/hide peak line based on peak value
    if (peak_value > 0.01f) {  // Show if peak > 1%
        lv_obj_clear_flag(peak_line, LV_OBJ_FLAG_HIDDEN);
    } else {
        lv_obj_add_flag(peak_line, LV_OBJ_FLAG_HIDDEN);
    }
}

void UITask::adaptiveRefreshControl() {
    uint32_t current_time = (uint32_t)(esp_timer_get_time() / 1000);  // Convert to ms

    // Only refresh if content has changed and enough time has passed
    if (m_context.content_changed) {
        uint32_t time_since_last_refresh = current_time - m_context.last_refresh_time;

        // Use minimum refresh interval for responsive updates
        if (time_since_last_refresh >= MIN_REFRESH_INTERVAL_MS) {
            if (auto *display = wavex_ui::DisplayManager::instance().display()) {
                LV_LOCK();
                lv_refr_now(display);
                LV_UNLOCK();
            }

            m_context.content_changed = false;
            m_context.last_refresh_time = current_time;
            m_context.refresh_count++;

            // Log refresh rate every 100 refreshes for monitoring
            if (m_context.refresh_count % 100 == 0) {
                ESP_LOGD(TAG, "Display refresh count: %lu", m_context.refresh_count);
            }
        }
    }
}

void UITask::uiTaskFunction(void *pvParameters) {
    UITask *ui_task = (UITask *)pvParameters;
    if (!ui_task) {
        ESP_LOGE(TAG, "UI task function called with NULL parameter");
        vTaskDelete(NULL);
        return;
    }

    ui_task->run();
}

void UITask::run() {
    ESP_LOGI(TAG, "UI task started with full UI support");

    // Defer layout construction to the navigator stack
    ESP_LOGI(TAG, "Handing layout control to navigator stack");

    // Main UI loop with adaptive refresh rate control
    ESP_LOGI(TAG, "UI loop started with adaptive refresh rate control");
    while (1) {
        // Apply encoder movement to active UI when applicable
        int32_t enc_delta = pcnt_consume_delta(WAVEX_ENCODER_PCNT_UNIT);
        if (enc_delta != 0) {
            // Post unified input events for encoder movement
            wavex_ui::InputEvent evt;
            evt.type = (enc_delta > 0) ? wavex_ui::InputType::EncoderRight
                                       : wavex_ui::InputType::EncoderLeft;
            evt.delta = (int16_t)enc_delta;
            evt.timestamp_ms = (uint32_t)(esp_timer_get_time() / 1000);
            wavex_ui::InputDispatcher::instance().post(evt);

            // Navigation system handles all encoder input through InputDispatcher
            // No need for manual encoder handling here
        }

        // Read potentiometer encoder (PCNT1) for scrolling
#if WAVEX_ESP_PCNT1_ENABLED
        int32_t pot_delta = pcnt_consume_delta(WAVEX_PCNT1_UNIT);
        if (pot_delta != 0) {
            // Accumulate raw counts and consume whole detents, carrying the
            // remainder forward. The old reset-to-zero logic discarded every
            // count beyond one detent per poll window, so fast turns lost
            // most of their steps - the list moved far less than the knob.
            m_context.pcnt1_delta_accumulator += pot_delta;

            const int32_t detents =
                m_context.pcnt1_delta_accumulator / WAVEX_PCNT1_COUNTS_PER_DETENT;
            if (detents != 0) {
                m_context.pcnt1_delta_accumulator -= detents * WAVEX_PCNT1_COUNTS_PER_DETENT;

                // One event carrying the full detent count; onInput walks the
                // delta one entry at a time.
                wavex_ui::InputEvent pot_evt;
                pot_evt.type = (detents > 0) ? wavex_ui::InputType::EncoderUp
                                             : wavex_ui::InputType::EncoderDown;
                pot_evt.delta = (int16_t)((detents > 0) ? detents : -detents);
                pot_evt.timestamp_ms = (uint32_t)(esp_timer_get_time() / 1000);

                ESP_LOGD(TAG,
                         "PCNT1 encoder: %ld detent(s), posting %s (remainder=%d)",
                         (long)detents,
                         (detents > 0) ? "EncoderUp" : "EncoderDown",
                         m_context.pcnt1_delta_accumulator);

                bool posted = wavex_ui::InputDispatcher::instance().post(pot_evt);
                if (!posted) {
                    ESP_LOGW(TAG, "Failed to post PCNT1 encoder event to queue");
                }
            }
        }
#endif
        // Dispatch queued input events to current context. processAll() takes
        // the LVGL port lock around each event itself (see input_dispatcher.cpp
        // for why per event and not around the drain), so no lock here.
        wavex_ui::InputDispatcher::instance().processAll();

        // Debug-build serial screenshots (no-op stub in release; manages
        // its own LVGL locking, so called outside LV_LOCK).
        wavex_screenshot_poll();

        // Apply what the comm callbacks staged. Those run on the UART task and
        // may only raise flags; this is where the widgets actually change.
        LV_LOCK();
        wavex_ui::BusyOverlay::service();
        wavex_ui::UISampleBrowser::processDeferredUpdates();
        LV_UNLOCK();

        // Use adaptive refresh control for optimal performance
        adaptiveRefreshControl();

        // Short delay to prevent excessive CPU usage
        vTaskDelay(pdMS_TO_TICKS(32));  // 32ms delay for 30 FPS theoretical maximum
    }
}

// UITask implementation
void UITask::createMeterDisplay(lv_obj_t *parent) {
    // Create meter container - full width and height of parent for 3-column layout
    LV_LOCK();
    lv_obj_t *meter_area = lv_obj_create(parent);
    lv_obj_set_size(meter_area, lv_pct(100), lv_pct(100));
    lv_obj_set_style_bg_color(meter_area,
                              lv_color_make(0x1A, 0x1A, 0x1A),
                              LV_PART_MAIN);  // Dark gray background to match columns
    lv_obj_set_style_border_width(
        meter_area, 0, LV_PART_MAIN);  // No border since parent column has border
    lv_obj_align(meter_area, LV_ALIGN_TOP_LEFT, 0, 0);

    // Meter title
    lv_obj_t *meter_title = lv_label_create(meter_area);
    lv_label_set_text(meter_title, "Audio Meters");
    lv_obj_set_style_text_color(
        meter_title, lv_color_white(), LV_PART_MAIN);  // White text for dark mode
    lv_obj_set_style_text_font(meter_title, &lv_font_montserrat_18, LV_PART_MAIN);
    lv_obj_align(meter_title, LV_ALIGN_TOP_MID, 0, 5);

