pmorgantech/WaveX/firmware/esp32/main/ui_task.cpp
    // Left channel container
    lv_obj_t *left_channel = lv_obj_create(meter_area);
    lv_obj_set_size(left_channel, lv_pct(45), lv_pct(70));
    lv_obj_set_style_bg_color(
        left_channel, lv_color_make(0x2A, 0x2A, 0x2A), LV_PART_MAIN);  // Dark gray background
    lv_obj_set_style_border_width(left_channel, 1, LV_PART_MAIN);
    lv_obj_set_style_border_color(left_channel, lv_color_make(0x4C, 0xAF, 0x50), LV_PART_MAIN);
    lv_obj_align(left_channel, LV_ALIGN_LEFT_MID, 0, 0);

    // Left channel label
    lv_obj_t *left_label = lv_label_create(left_channel);
    lv_label_set_text(left_label, "LEFT");
    lv_obj_set_style_text_color(
        left_label, lv_color_white(), LV_PART_MAIN);  // White text for dark mode
    lv_obj_set_style_text_font(left_label, &lv_font_montserrat_14, LV_PART_MAIN);
    lv_obj_align(left_label, LV_ALIGN_TOP_MID, 0, 5);

    // Left channel RMS bar
    m_context.meter_display.bar_l = lv_bar_create(left_channel);
    lv_obj_set_size(m_context.meter_display.bar_l, lv_pct(80), 20);
    lv_obj_align(m_context.meter_display.bar_l, LV_ALIGN_CENTER, 0, -10);
    lv_bar_set_range(m_context.meter_display.bar_l, 0, 100);
    lv_bar_set_value(m_context.meter_display.bar_l, 0, LV_ANIM_OFF);
    lv_obj_set_style_bg_color(
        m_context.meter_display.bar_l, lv_color_make(0x4C, 0xAF, 0x50), LV_PART_INDICATOR);

    // Left channel peak line (initially hidden) - as child of meter bar
    m_context.meter_display.peak_line_l = lv_obj_create(m_context.meter_display.bar_l);
    lv_obj_set_size(m_context.meter_display.peak_line_l, 2, 20);
    lv_obj_set_style_bg_color(
        m_context.meter_display.peak_line_l, lv_color_make(0xFF, 0x57, 0x22), LV_PART_MAIN);
    lv_obj_set_style_border_width(m_context.meter_display.peak_line_l, 0, LV_PART_MAIN);
    lv_obj_set_pos(m_context.meter_display.peak_line_l, 0, 0);
    lv_obj_add_flag(m_context.meter_display.peak_line_l, LV_OBJ_FLAG_HIDDEN);

    // Left channel values label
    m_context.meter_display.label_l = lv_label_create(left_channel);
    lv_label_set_text(m_context.meter_display.label_l, "L: 0.000\nPeak: 0.000");
    lv_obj_set_style_text_color(m_context.meter_display.label_l,
                                lv_color_white(),
                                LV_PART_MAIN);  // White text for dark mode
    lv_obj_set_style_text_font(
        m_context.meter_display.label_l, &lv_font_montserrat_14, LV_PART_MAIN);
    lv_obj_align(m_context.meter_display.label_l, LV_ALIGN_BOTTOM_MID, 0, -5);

    // Right channel container
    lv_obj_t *right_channel = lv_obj_create(meter_area);
    lv_obj_set_size(right_channel, lv_pct(45), lv_pct(70));
    lv_obj_set_style_bg_color(
        right_channel, lv_color_make(0x2A, 0x2A, 0x2A), LV_PART_MAIN);  // Dark gray background
    lv_obj_set_style_border_width(right_channel, 1, LV_PART_MAIN);
    lv_obj_set_style_border_color(right_channel, lv_color_make(0x4C, 0xAF, 0x50), LV_PART_MAIN);
    lv_obj_align(right_channel, LV_ALIGN_RIGHT_MID, 0, 0);

    // Right channel label
    lv_obj_t *right_label = lv_label_create(right_channel);
    lv_label_set_text(right_label, "RIGHT");
    lv_obj_set_style_text_color(
        right_label, lv_color_white(), LV_PART_MAIN);  // White text for dark mode
    lv_obj_set_style_text_font(right_label, &lv_font_montserrat_14, LV_PART_MAIN);
    lv_obj_align(right_label, LV_ALIGN_TOP_MID, 0, 5);

    // Right channel RMS bar
    m_context.meter_display.bar_r = lv_bar_create(right_channel);
    lv_obj_set_size(m_context.meter_display.bar_r, lv_pct(80), 20);
    lv_obj_align(m_context.meter_display.bar_r, LV_ALIGN_CENTER, 0, -10);
    lv_bar_set_range(m_context.meter_display.bar_r, 0, 100);
    lv_bar_set_value(m_context.meter_display.bar_r, 0, LV_ANIM_OFF);
    lv_obj_set_style_bg_color(
        m_context.meter_display.bar_r, lv_color_make(0x4C, 0xAF, 0x50), LV_PART_INDICATOR);

    // Right channel peak line (initially hidden) - as child of meter bar
    m_context.meter_display.peak_line_r = lv_obj_create(m_context.meter_display.bar_r);
    lv_obj_set_size(m_context.meter_display.peak_line_r, 2, 20);
    lv_obj_set_style_bg_color(
        m_context.meter_display.peak_line_r, lv_color_make(0xFF, 0x57, 0x22), LV_PART_MAIN);
    lv_obj_set_style_border_width(m_context.meter_display.peak_line_r, 0, LV_PART_MAIN);
    lv_obj_set_pos(m_context.meter_display.peak_line_r, 0, 0);
    lv_obj_add_flag(m_context.meter_display.peak_line_r, LV_OBJ_FLAG_HIDDEN);

    // Right channel values label
    m_context.meter_display.label_r = lv_label_create(right_channel);
    lv_label_set_text(m_context.meter_display.label_r, "R: 0.000\nPeak: 0.000");
    lv_obj_set_style_text_color(m_context.meter_display.label_r,
                                lv_color_white(),
                                LV_PART_MAIN);  // White text for dark mode
    lv_obj_set_style_text_font(
        m_context.meter_display.label_r, &lv_font_montserrat_14, LV_PART_MAIN);
    lv_obj_align(m_context.meter_display.label_r, LV_ALIGN_BOTTOM_MID, 0, -5);

    // Peak hold info label
    lv_obj_t *peak_info = lv_label_create(meter_area);
    lv_label_set_text(peak_info, "Peak Hold: 500ms");
    lv_obj_set_style_text_color(
        peak_info, lv_color_white(), LV_PART_MAIN);  // White text for dark mode
    lv_obj_set_style_text_font(peak_info, &lv_font_montserrat_14, LV_PART_MAIN);
    lv_obj_align(peak_info, LV_ALIGN_BOTTOM_MID, 0, -5);

    // Populate deferred meter values from current backend snapshot so UI can show immediately
    wavex_meter_data_t md;
    m_context.comm_interface->getMeterData(&md);
    if (md.valid) {
        m_context.deferred_rms_left = md.rms_left;
        m_context.deferred_rms_right = md.rms_right;
        m_context.deferred_peak_left = md.peak_left;
        m_context.deferred_peak_right = md.peak_right;
    }

    // Mark an initial update so the meters render as soon as the page is created
    m_context.meter_update_pending = true;
    markContentChanged();
    ESP_LOGI(TAG,
             "METER_UI: meter widgets created and initial update scheduled L=%.3f R=%.3f",
             m_context.deferred_rms_left,
             m_context.deferred_rms_right);

    // Create LVGL timer to ensure deferred updates are applied in LVGL context
    if (!m_context.meter_lvgl_timer) {
        m_context.meter_lvgl_timer = lv_timer_create(lvglMeterApplyCallback, 50, &m_context);
        if (!m_context.meter_lvgl_timer) {
            ESP_LOGE(TAG, "Failed to create meter LVGL timer");
        }
    }

    LV_UNLOCK();
}

// Global functions for C compatibility
esp_err_t wavex_ui_task_start(WaveX::Comm::ICommInterface &comm_interface) {
    if (g_ui_task_instance) {
        ESP_LOGE(TAG, "UI task already started");
        return ESP_FAIL;
    }

    g_ui_task_instance = new UITask(comm_interface);
    if (!g_ui_task_instance) {
        ESP_LOGE(TAG, "Failed to create UI task instance");
        return ESP_FAIL;
    }

    esp_err_t ret = g_ui_task_instance->init();
    if (ret != ESP_OK) {
        delete g_ui_task_instance;
        g_ui_task_instance = nullptr;
        return ret;
    }

    return g_ui_task_instance->start();
}

esp_err_t wavex_ui_task_stop(void) {
    if (!g_ui_task_instance) {
        ESP_LOGW(TAG, "UI task not started");
        return ESP_OK;
    }

    esp_err_t ret = g_ui_task_instance->stop();
    delete g_ui_task_instance;
    g_ui_task_instance = nullptr;
    return ret;
}

esp_err_t wavex_ui_get_panel_handle(esp_lcd_panel_handle_t *panel_handle) {
    if (!g_ui_task_instance) {
        ESP_LOGE(TAG, "UI task not started");
        return ESP_FAIL;
    }

    return g_ui_task_instance->getPanelHandle(panel_handle);
}

void wavex_ui_mark_content_changed(void) {
    if (g_ui_task_instance) {
        g_ui_task_instance->markContentChanged();
    }
}

void wavex_ui_create_meter_display(lv_obj_t *parent) {
    if (g_ui_task_instance) {
        g_ui_task_instance->createMeterDisplay(parent);
    }
}
